resume.tex
% Created 2015-07-08 Wed 18:52
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Brandon Fulk}
\date{\today}
\title{resume}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.4.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Brandon Fulk's Resume}
\label{sec-1}
\subsection{Education}
\label{sec-1-1}
\subsubsection{2005-2006: Electrical Engineering, Computer Engineering.  University of Minnesota, Twin Cities.}
\label{sec-1-1-1}
\subsubsection{2006-2012: Biological Sciences, Computational Biology, Bioinformatics, Computer Science.  University of Nebraska, Lincoln.}
\label{sec-1-1-2}

\subsection{Experience}
\label{sec-1-2}
\subsubsection{April 2012-present: Developer, CTO. 42}
\label{sec-1-2-1}
\begin{enumerate}
\item Skills: Ruby on Rails, Arel, SQL, Backbone, AngularJS, DevOps, Project Management, Android and Cross Platform (Apache Cordova) mobile frameworks.
\label{sec-1-2-1-1}
\item Accomplishments:
\label{sec-1-2-1-2}
\begin{enumerate}
\item Was brought on for the company's first Rails project.
\label{sec-1-2-1-2-1}
\item Helped switch to git for version control.
\label{sec-1-2-1-2-2}
\item Implemented Capistrano for deployments.
\label{sec-1-2-1-2-3}
\item Pushed for Test Driven and Behavior Driven Development with RSpec, Capybara, and Cucumber.
\label{sec-1-2-1-2-4}
\item Automated and put server provisioning under version control with Chef.
\label{sec-1-2-1-2-5}
\item Implemented portable development environments with Vagrant.
\label{sec-1-2-1-2-6}
\item Built a Continuous Integration and build server with Jenkins.
\label{sec-1-2-1-2-7}
\item Switched new clients over to Amazon AWS from Rackspace.
\label{sec-1-2-1-2-8}
\item Started using NGinx for projects that could take advantage of its event driven design.
\label{sec-1-2-1-2-9}
\item Implemented Native Android Application for Duncan Aviation.
\label{sec-1-2-1-2-10}
\item Supported the backend and frontend development of RivalMe: a Sinatra API and Apache Cordova app.
\label{sec-1-2-1-2-11}
\end{enumerate}
\end{enumerate}
\subsubsection{January 2009-April 2012: Research Assistant. Bioinformatics Lab of Dr. Etsuko Moriyama}
\label{sec-1-2-2}
\begin{enumerate}
\item Skills: Perl, PHP, C, Emacs, Machine Learning.
\label{sec-1-2-2-1}
\item Accomplishments:
\label{sec-1-2-2-2}
\begin{enumerate}
\item Main research was in G Protein Evolution in Plants.
\label{sec-1-2-2-2-1}
\item G Protein Interactome in \emph{Arabidopsis thaliana}.
\label{sec-1-2-2-2-2}
\begin{enumerate}
\item Work was included in Klopffleish, K. et al. \emph{Arabidopsis} G-protein interactome reveals connections to cell wall carbohydrates and morphogenesis. Molecular Systems Biology
\label{sec-1-2-2-2-2-1}
\end{enumerate}
\item Participated in Poster and Speech presentations.
\label{sec-1-2-2-2-3}
\begin{enumerate}
\item October 2011 - G-Protein Interactome in \emph{Arabidopsis thaliana}. Poster Presentation at the Plant Science Innovation Symposium - Lincoln, NE.
\label{sec-1-2-2-2-3-1}
\item October 2010 - Molecular Evolution of G-Proteins. Poster Presentation at the Science, Technology, Engineering, and Mathematics Conference - Lincoln, NE.
\label{sec-1-2-2-2-3-2}
\item October 2009 - Molecular Evolution of G-Proteins. Speech and Poster Presentation at Biotechnology and Bioinformatics Symposium - Lincoln, NE.
\label{sec-1-2-2-2-3-3}
\item Summer 2009 - Molecular Evolution of G-Proteins. Poster Presentation at Annual Meeting of the Society of Molecular Biology and Evolution - Iowa City, IA.
\label{sec-1-2-2-2-3-4}
\end{enumerate}
\item Implemented Pariwise Comparison algorithm in C to optimize orginal Perl program and orders of magnitude of computation time.
\label{sec-1-2-2-2-4}
\item Utilized UNL's Supercomputer for experiments.
\label{sec-1-2-2-2-5}
\item Became familiar with PBS and TORQUE job scheduling.
\label{sec-1-2-2-2-6}
\item Provided support for a Condor High-Throughput Computing implementation of indel-Seq-Gen.
\label{sec-1-2-2-2-7}
\item Used Machine Learning, namely Support Vector Machines and Hidden Markov Models, for protein classification.
\label{sec-1-2-2-2-8}
\end{enumerate}
\end{enumerate}
% Emacs 24.4.1 (Org mode 8.2.10)
\end{document}
